In [1]:
import pandas as pd
import matplotlib.pyplot as plt

from sklearn.manifold import TSNE
from sklearn.decomposition import PCA
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.cluster import KMeans
from pathlib import Path

import numpy as np
import pandas as pd
from pathlib import Path
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LinearRegression

In [25]:
# Import the data
salaries = pd.read_csv("../Outputs/Full_Salary_Data.csv")
salaries

       Experience_Years    Job_Position    Salary  Company_Size  Year
0                    15    Data Analyst  130000.0          1000  2022
1                    22    Data Analyst  450000.0          1000  2022
2                     5    Data Analyst   78084.0        100000  2022
3                    12    Data Analyst   15480.0        100000  2022
4                    11    Data Analyst  200000.0         50000  2022
...                 ...             ...       ...           ...   ...
43598                 5  Data Scientist  110000.0           100  2016
43599                10  Data Scientist  190000.0           100  2016
43600                10  Data Scientist  160000.0          1000  2016
43601                15  Data Scientist  200000.0            10  2016
43602                10  Data Scientist   50000.0           100  2016

[43603 rows x 5 columns]

In [26]:
salaries['Job_Position'] = salaries['Job_Position'].replace(["Data Analyst"],[1])
salaries['Job_Position'] = salaries['Job_Position'].replace(["Data Scientist"],[2])
salaries['Job_Position'] = salaries['Job_Position'].replace(["Machine Learning Engineer"],[3])
# salaries['Job_Position'].value_counts()

In [27]:
salaries = salaries.drop(columns='Company_Size')
salaries.head(10)

   Experience_Years  Job_Position    Salary  Year
0                15             1  130000.0  2022
1                22             1  450000.0  2022
2                 5             1   78084.0  2022
3                12             1   15480.0  2022
4                11             1  200000.0  2022
5                 5             1   54025.0  2022
6                 3             1   58654.0  2022
7                20             1   68252.0  2022
8                12             1   93846.0  2022
9                 5             1   34126.0  2022

In [5]:
# scaler = StandardScaler()
# salary_scaled = scaler.fit_transform(salary_cluster)

## PCA

In [6]:
# pca = PCA(n_components=0.90)
# pca = pca.fit_transform(salary_scaled)
# pca_df = pd.DataFrame(salary_scaled)
# pca_df.head()

## TSNE

In [7]:
# tsne = TSNE(learning_rate=100)
# tsne = tsne.fit_transform(pca_df)

In [8]:
# plt.scatter(tsne[:,0],tsne[:,1])

In [9]:
# plt.scatter(x=pca_df[0], y=pca_df[1], 
#             c=pca_df[2])
# plt.xlabel('1')
# plt.ylabel('2')
# plt.title('Iris clusters')
# plt.show()

## K-Means

In [10]:
# salary = []

# for k in range(1,10):
#     kmeans = KMeans(n_clusters=k, random_state=42)
#     kmeans.fit(pca_df)
#     salary.append(kmeans.inertia_)

In [11]:
# elbow = pd.DataFrame({"k": range(1,10), "salary": salary})

In [12]:
# plt.plot(elbow["k"], elbow["salary"])
# plt.xticks(range(1,11))
# plt.xlabel("Clusters")
# plt.ylabel("Salary")
# plt.title("K-Means Clusters")
# plt.show()

## Forecasting

In [30]:
salaries.head()

   Experience_Years  Job_Position    Salary  Year
0                15             1  130000.0  2022
1                22             1  450000.0  2022
2                 5             1   78084.0  2022
3                12             1   15480.0  2022
4                11             1  200000.0  2022

In [35]:
# Split the data into X_train, X_test, y_train, y_test
x_salary = salaries.drop(columns=['Salary','Year'])
y_salary = salaries['Salary']

x_train, x_test, y_train, y_test = train_test_split(x_salary, y_salary, random_state=50)

In [36]:
# Train a Logistic Regression model print the model score
classifier = LinearRegression()
classifier.fit(x_train, y_train)

print(f'Training Data Score: {classifier.score(x_train, y_train)}')
print(f'Testing Data Score: {classifier.score(x_test, y_test)}')

Training Data Score: 8.65173574380318e-05
Testing Data Score: -0.000125615299045867

NameError: name 'salary' is not defined

In [15]:
# # Train a Random Forest Classifier model and print the model score
# scaler = StandardScaler().fit(x_train)
# x_train_scaled = scaler.transform(x_train)
# x_test_scaled = scaler.transform(x_test)
# clf = RandomForestClassifier(random_state=42).fit(x_train_scaled, y_train)

# print(f'Training Score: {clf.score(x_train_scaled, y_train)}')
# print(f'Testing Score: {clf.score(x_test_scaled, y_test)}')